//ActorDirector 表： 
//
// 
//+-------------+---------+
//| Column Name | Type    |
//+-------------+---------+
//| actor_id    | int     |
//| director_id | int     |
//| timestamp   | int     |
//+-------------+---------+
//timestamp 是这张表的主键(具有唯一值的列).
// 
//
// 
//
// 编写解决方案找出合作过至少三次的演员和导演的 id 对 (actor_id, director_id) 
//
// 
//
// 示例 1： 
//
// 
//输入：
//ActorDirector 表：
//+-------------+-------------+-------------+
//| actor_id    | director_id | timestamp   |
//+-------------+-------------+-------------+
//| 1           | 1           | 0           |
//| 1           | 1           | 1           |
//| 1           | 1           | 2           |
//| 1           | 2           | 3           |
//| 1           | 2           | 4           |
//| 2           | 1           | 5           |
//| 2           | 1           | 6           |
//+-------------+-------------+-------------+
//输出：
//+-------------+-------------+
//| actor_id    | director_id |
//+-------------+-------------+
//| 1           | 1           |
//+-------------+-------------+
//解释：
//唯一的 id 对是 (1, 1)，他们恰好合作了 3 次。 
//
// Related Topics 数据库 👍 83 👎 0

package main

func main() {

}

//There is no code of Go type for this problem

SELECT actor_id, director_id FROM actordirector GROUP BY actor_id, director_id HAVING COUNT(*) >= 3;
