//给你一个正整数数组 nums ，对 nums 所有元素求积之后，找出并返回乘积中 不同质因数 的数目。
//
// 注意：
//
//
// 质数 是指大于 1 且仅能被 1 及自身整除的数字。
// 如果 val2 / val1 是一个整数，则整数 val1 是另一个整数 val2 的一个因数。
//
//
//
//
// 示例 1：
//
// 输入：nums = [2,4,3,7,10,6]
//输出：4
//解释：
//nums 中所有元素的乘积是：2 * 4 * 3 * 7 * 10 * 6 = 10080 = 2⁵ * 3² * 5 * 7 。
//共有 4 个不同的质因数，所以返回 4 。
//
//
// 示例 2：
//
// 输入：nums = [2,4,8,16]
//输出：1
//解释：
//nums 中所有元素的乘积是：2 * 4 * 8 * 16 = 1024 = 2¹⁰ 。
//共有 1 个不同的质因数，所以返回 1 。
//
//
//
// 提示：
//
//
// 1 <= nums.length <= 10⁴
// 2 <= nums[i] <= 1000
//
//
// Related Topics 数组 哈希表 数学 数论 👍 22 👎 0

package main

import (
	"math"
)

func main() {
	distinctPrimeFactors(nil)
}

// leetcode submit region begin(Prohibit modification and deletion)
func distinctPrimeFactors(nums []int) int {
	//prime := []int{2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587, 593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811, 821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911, 919, 929, 937, 941, 947, 953, 967, 971, 977, 983, 991, 997}
	prime := make(map[int]struct{})
	for _, v := range nums {
		for i := 2; i*i <= v; i++ {
			if v%i == 0 {
				v /= i
				prime[i] = struct{}{}
				for v%i == 0 {
					v /= i
				}
			}
		}
		if v > 1 { // 余下的
			prime[v] = struct{}{}
		}
	}
	return len(prime)
}

// leetcode submit region end(Prohibit modification and deletion)
func primeNum() {
	prime := []int{2}
out:
	for i := 3; i <= 1000; i += 2 {
		sqrt := int(math.Sqrt(float64(i)))
		for j := 3; j <= sqrt; j++ {
			if i%j == 0 {
				continue out
			}
		}
		prime = append(prime, i)
	}
}
