//给你一个下标从 0 开始长度为 n 的整数数组 stations ，其中 stations[i] 表示第 i 座城市的供电站数目。
//
// 每个供电站可以在一定 范围 内给所有城市提供电力。换句话说，如果给定的范围是 r ，在城市 i 处的供电站可以给所有满足 |i - j| <= r 且 0
// <= i, j <= n - 1 的城市 j 供电。
//
//
// |x| 表示 x 的 绝对值 。比方说，|7 - 5| = 2 ，|3 - 10| = 7 。
//
//
// 一座城市的 电量 是所有能给它供电的供电站数目。
//
// 政府批准了可以额外建造 k 座供电站，你需要决定这些供电站分别应该建在哪里，这些供电站与已经存在的供电站有相同的供电范围。
//
// 给你两个整数 r 和 k ，如果以最优策略建造额外的发电站，返回所有城市中，最小电量的最大值是多少。
//
// 这 k 座供电站可以建在多个城市。
//
//
//
// 示例 1：
//
//
//输入：stations = [1,2,4,5,0], r = 1, k = 2
//输出：5
//解释：
//最优方案之一是把 2 座供电站都建在城市 1 。
//每座城市的供电站数目分别为 [1,4,4,5,0] 。
//- 城市 0 的供电站数目为 1 + 4 = 5 。
//- 城市 1 的供电站数目为 1 + 4 + 4 = 9 。
//- 城市 2 的供电站数目为 4 + 4 + 5 = 13 。
//- 城市 3 的供电站数目为 5 + 4 = 9 。
//- 城市 4 的供电站数目为 5 + 0 = 5 。
//供电站数目最少是 5 。
//无法得到更优解，所以我们返回 5 。
//
//
// 示例 2：
//
//
//输入：stations = [4,4,4,4], r = 0, k = 3
//输出：4
//解释：
//无论如何安排，总有一座城市的供电站数目是 4 ，所以最优解是 4 。
//
//
//
//
// 提示：
//
//
// n == stations.length
// 1 <= n <= 10⁵
// 0 <= stations[i] <= 10⁵
// 0 <= r <= n - 1
// 0 <= k <= 10⁹
//
//
// Related Topics 贪心 队列 数组 二分查找 前缀和 滑动窗口 👍 49 👎 0

package main

import (
	"fmt"
	"math"
	"sort"
)

func main() {
	stations := []int{1, 2, 4, 5, 0}
	r, k := 1, 2
	//stations = []int{4, 4, 4}
	//r, k = 0, 2
	stations = []int{2, 10, 12, 3}
	r, k = 0, 14
	power := maxPower(stations, r, k)
	fmt.Println(power)

	arr := []int{1, 3, 6, 7, 9}
	t := 10
	idx := sort.Search(len(arr), func(i int) bool {
		return arr[i] >= t
	})
	fmt.Println("idx:", idx)
}

// leetcode submit region begin(Prohibit modification and deletion)
func maxPower(stations []int, r int, k int) int64 {
	n := len(stations)
	pow := make([]int, n)
	mi, s := math.MaxInt, 0
	for i := 0; i < r; i++ {
		s += stations[i]
	}
	for i := 0; i < n; i++ { // 未建电站时，各城市的电量。也可用前缀和来实现
		if i+r < n {
			s += stations[i+r]
		}
		pow[i] = s
		mi = min(mi, s) // 最小值
		if i-r >= 0 {
			s -= stations[i-r]
		}
	}
	kp := sort.Search(k, func(minPower int) bool { // 二分+贪心：i 需要电站时，则新建在 i+r 处，因为左侧的已不需要新建
		minPower += mi + 1     // 重点：+1，因为 sort.Search 源码中查出来是 >= minPower，但是 = 是正解，> 是错解
		diff := make([]int, n) // 差分数组
		var d, cnt int         // d：差分值，cnt：新建的电站数
		for i, p := range pow {
			d += diff[i]
			m := minPower - p - d // 城市 i 需要新建 m 个
			if m > 0 {            // 需要“新建”电站
				cnt += m
				if cnt > k { // true
					return true
				}
				d += m                            //diff[i] += m：差分数组更新，直接
				if idx := i + r<<1 + 1; idx < n { // 更新差分数组右端
					diff[idx] -= m
				}
			}
		}
		return false
	})
	return int64(mi + kp)
}

//leetcode submit region end(Prohibit modification and deletion)
