//编写一个程序，通过填充空格来解决数独问题。
//
// 数独的解法需 遵循如下规则：
//
//
// 数字 1-9 在每一行只能出现一次。
// 数字 1-9 在每一列只能出现一次。
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
//
//
// 数独部分空格内已填入了数字，空白格用 '.' 表示。
//
//
//
//
//
//
// 示例 1：
//
//
//输入：board = [["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".
//",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".
//","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6
//"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[
//".",".",".",".","8",".",".","7","9"]]
//输出：[["5","3","4","6","7","8","9","1","2"],["6","7","2","1","9","5","3","4","8
//"],["1","9","8","3","4","2","5","6","7"],["8","5","9","7","6","1","4","2","3"],[
//"4","2","6","8","5","3","7","9","1"],["7","1","3","9","2","4","8","5","6"],["9",
//"6","1","5","3","7","2","8","4"],["2","8","7","4","1","9","6","3","5"],["3","4",
//"5","2","8","6","1","7","9"]]
//解释：输入的数独如上图所示，唯一有效的解决方案如下所示：
//
//
//
//
//
//
//
//
//
// 提示：
//
//
// board.length == 9
// board[i].length == 9
// board[i][j] 是一位数字或者 '.'
// 题目数据 保证 输入数独仅有一个解
//
//
// Related Topics 数组 哈希表 回溯 矩阵 👍 1822 👎 0

package main

func main() {

}

// leetcode submit region begin(Prohibit modification and deletion)
func solveSudoku(board [][]byte) {

}

//leetcode submit region end(Prohibit modification and deletion)

//func solveSudoku(board [][]byte) {
//	const n, m, dot, o = 9, 3, '.', '1'
//	const N = 1<<n - 1
//	row, col, box := [n]int{}, [n]int{}, [n]int{}
//	boxIdx := func(i, j int) int {
//		return i - i%m + j/m // 对九宫格编号
//	}
//	for i, b := range board {
//		for j, v := range b {
//			if v != dot {
//				bit := 1 << (v - o)
//				row[i] |= bit
//				col[j] |= bit
//				box[boxIdx(i, j)] |= bit
//			}
//		}
//	}
//
//	var dfs func(int, int) bool
//	dfs = func(i, j int) bool {
//		if j == n {
//			i++
//			if i == n { // 已 solve
//				return true
//			}
//			j = 0
//		}
//		if board[i][j] != dot {
//			return dfs(i, j+1)
//		}
//		idx := boxIdx(i, j)
//		bit := N ^ (row[i] | col[j] | box[idx]) // 可填数字
//		for ; bit > 0; bit &= bit - 1 {         // 枚举可填数字
//			v := bit & -bit // 获取最低位 1
//			row[i] |= v
//			col[j] |= v
//			box[idx] |= v
//			board[i][j] = byte(bits.Len(uint(v)-1) + o) // 填入数字
//			if dfs(i, j+1) {
//				return true
//			}
//			row[i] ^= v // 回溯
//			col[j] ^= v
//			box[idx] ^= v
//			board[i][j] = dot
//		}
//		return false
//	}
//	dfs(0, 0)
//}
