package selective

/*
不定期福利第一期 | 数据结构与算法学习书单

针对入门的趣味书
	建议不要过度追求上去就看经典书
		像《算法导论》《算法》这些书，虽然比较经典、比较权威，但是非常厚，一旦啃不下来，挫败感就会很强
	不要太在意书写得深浅，重要的是能不能坚持看完
		《大话数据结构》
			把理论讲得很有趣，不枯燥
			每个数据结构和算法，作者都结合生活中的例子进行了讲解，能让你有非常直观的感受
		《算法图解》
			跟《大话数据结构》走的是同样的路线
			就像这本书副标题写的那样，“像小说一样有趣的算法入门书”，主打“图解”，通俗易懂
		这些入门书共同的问题是，缺少细节，不够系统，也不够严谨
针对特定编程语言的教科书
	《数据结构和算法分析》
		国内外很多大学都拿这本书当作教材
		非常系统、全面、严谨，而且又不是特别难，适合对数据结构和算法有些了解，并且掌握了至少一门编程语言的同学
		用了三种语言，写了三个版本，分别是：
			《数据结构与算法分析 ：C 语言描述》
			《数据结构与算法分析：C++ 描述》
			《数据结构与算法分析：Java 语言描述》
	Python or JavaScript
		《数据结构与算法 JavaScript 描述》《数据结构与算法：Python 语言描述》
面试必刷的宝典
	《剑指 offer》
		包含了所有常见的、经典的面试题，应付一般公司的面试应该不成问题
	《编程珠玑》
		最大的特色就是讲了很多针对海量数据的处理技巧
		管是开拓眼界，还是应付面试，这本书都很值得一看
	《编程之美》
		这本书有多位作者，其中绝大部分是微软的工程师，所以书的质量很有保证
		算法题目稍微有点难，也不是很系统
		有一定基础，也喜欢钻研些算法问题，或者要面试 Google、Facebook 这样的公司，可以拿这本书里的题，先来自测一下
经典大部头
	《算法导论》
		章节安排不是循序渐进的
		里面充斥着各种算法的正确性、复杂度的证明、推导，数学公式比较多，一般人看起来会比较吃力
		麻省理工公开课
	《算法》
		比起《算法导论》来要友好很多，更容易看懂，更适合初学者入门
		缺点是内容不够全面，比如动态规划这么重要的知识点，这本书就没有讲
		对于数据结构的东西，它讲的也不多，基本就是偏重讲算法
殿堂级经典
	《计算机程序设计艺术》
		王争也只看过比较简单的几卷，比如《基本算法》《排序和查找》
		这套书的深度、广度、系统性、全面性是其他所有数据结构和算法书籍都无法相比的
		没有很好的数学、算法、计算机基础，想要把这套书读完、读懂是比较难的
闲暇阅读
	《算法帝国》
	《数学之美》
	《算法之美》
		共同的特点是，都列举了大量的例子，非常通俗易懂，像《算法帝国》，文科生都能读懂

图示
	01.books.jpg
GitHub
	https://github.com/wangzheng0822/algo
*/
