package selective

/*
不定期福利第二期 | 王争：羁绊前行的，不是肆虐的狂风，而是内心的迷茫

如果我们不那么确信能不能看懂、能不能学会的时候，当面对困难的时候，很容易就会否定自己，也就很容易半途而废

Tip 1：没有捷径，没有杀手锏，更没有一招致胜的“葵花宝典”
	这些方法论的难点并不在于能不能听懂，而是在于能不能执行到位
	比如“一万小时定律“
Tip 2：不要浮躁，不要丧失思考能力，不要丧失学习能力
	最宝贵的东西，是你自己的思考能力、学习能力，能自己沉下心来研究的能力
	很多人陷入各种手机 App 中不能自拔，学一会儿就想玩会儿手机，想静下心来学上半个小时都无比困难
Tip 3：只有做好打硬仗的心理准备，遇到困难才能心态平和
	数据结构和算法就是一个非常难啃的硬骨头，可以说是计算机学科中最难学的学科之一了
	面对不懂的知识点，沉下心来逐个突破，这样你的信心慢慢也就建立了
Tip 4：“放弃”的念头像是一个心魔，它会一直围绕着你
	如果当时放弃了，那之后再遇到技术难题时，“放弃”的心魔还会再来拜访，潜意识里还是会认输
	没有学不会的东西，没有攻克不了的技术难题，如果有，那就说明时间花得还不够多
	即便短暂地停歇，也会继续拎起来再死磕
Tip 5：入门是一个非常漫长和煎熬的过程，谁都逃不过
	情商比智商更重要
	对于很多学科的学习，智商并不是瓶颈，最终能够决定你能达到的高度的，还是情商
	而情商中最重要的，我觉得就是逆商（逆境商数，Adversity Quotient）
	也就是，当你遇到困难时，你会如何去面对，这将会决定你的人生最终能够走多远
逆商
	02.insist_adrersity-quotient.jpg
*/
