package selective

/*
《数据结构与算法之美》学习指导手册

路线图：06.guide.jpg
	1.复杂度分析
		在不看我的分析的情况下，能自行分析专栏中大部分数据结构和算法的时间、空间复杂度
	2.数组、栈、队列
		能自己实现动态数组、栈、队列
	3.链表
		能轻松写出经典链表题目代码
	4.递归
		轻松写出二叉树遍历、八皇后、背包问题、DFS 的递归代码
	5.排序、二分查找
		能自己把各种排序算法、二分查找及其变体代码写一遍就可以了
	6.跳表
		初学者可以先跳过。如果感兴趣，看懂专栏内容即可，不需要掌握代码实现
	7.散列表
		对于初学者来说，自己能代码实现一个拉链法解决冲突的散列表即可
	8.哈希算法
		开拓思路
	9.二叉树
		能代码实现二叉树的三种遍历算法、按层遍历、求高度等经典二叉树题目
	10.红黑树
		开拓思路
	11.B+ 树
		开拓思路
	12.堆与堆排序
		能代码实现堆、堆排序，并且掌握堆的三种应用（优先级队列、Top k、中位数）
	13.图的表示
		理解图的三种表示方法（邻接矩阵、邻接表、逆邻接表），能自己代码实现
	14.深度广度优先搜索
		能代码实现广度优先、深度优先搜索算法
	15.拓扑排序、最短路径、A* 算法
		开拓思路
	16.字符串匹配（BF、RK）
		能实践 BF 算法，能看懂 RK 算法
	17.字符串匹配（BM、KMP、AC 自动机）
		开拓思路
	18.字符串匹配（Trie）
		能看懂，知道特点、应用场景即可，不要求代码实现
	19.位图
		看懂即可，能自己实现一个位图结构最好
	20.四种算法思想
		可以放到最后，但是一定要掌握！做到能实现 Leetcode 上 Medium 难度的题目
		要应付 FLAG 这样公司的面试，必须拿下这块内容
*/
