package dp

/*
记忆化搜索
	2944：https://leetcode.cn/problems/minimum-number-of-coins-for-fruits/solutions/2542044/dpcong-on2-dao-onpythonjavacgo-by-endles-nux5/

lc
	1473
	2712
	2919
	2588
	583：滚动数组

数位 dp
	面试题 17.06-2出现的次数
	2999
		上下界

	2719. 统计整数数目（题解）
	788. 旋转数字（题解）
	902. 最大为 N 的数字组合（题解）1990
	233. 数字 1 的个数（题解）
	面试题 17.06. 2 出现的次数（题解）
	600. 不含连续 1 的非负整数（题解）
	2376. 统计特殊整数（题解）2120
	1012. 至少有 1 位重复的数字（题解）2230
	357. 统计各位数字都不同的数字个数
	3007. 价值和小于等于 K 的最大数字 2258
	2827. 范围中美丽整数的数目 2324
	2999. 统计强大整数的数目 2351
	2801. 统计范围内的步进数字数目 2367
	1397. 找到所有好字符串 2667
	1215. 步进数（会员题）
	1067. 范围内的数字计数（会员题）
	1742. 盒子中小球的最大数量 *非暴力做法
	2843. 统计对称整数的数目 *非暴力做法

状压 dp
	2741
	526
	847
	698

树形 dp
	2538
*/
